Tekla.Structures.DirectManipulation.Adapter.Controls.ToolBarControlUpdater
The Tekla.Structures.DirectManipulation.Adapter.Controls.ToolBarControlUpdater class provides a method for updating a System.Windows.Controls.Control
based on the Tekla.BIM.DirectManipulation.Services.Controls.ControlBase instance found in the Control.Tag property.

Tekla.Structures.DirectManipulation.Adapter.Controls.ToolBarControlUpdater.Update(System.Windows.FrameworkElement,Tekla.BIM.DirectManipulation.Services.Controls.IControl,Tekla.Structures.DirectManipulation.Adapter.Controls.ToolBarControlFactory)
Updates a single item to match the state of the Tekla.BIM.DirectManipulation.Services.Controls.ControlBase according to the dataSource.
toolBarControl: The item to update.
dataSource: The control data.
factory: The toolbar control factory.

Tekla.Structures.DirectManipulation.Adapter.Controls.ToolBarControlUpdater.Update(System.Windows.FrameworkElement,Tekla.BIM.DirectManipulation.Services.Controls.ControlShortState,Tekla.Structures.DirectManipulation.Adapter.Controls.ToolBarControlFactory)
Updates a single item to match the state of the Tekla.BIM.DirectManipulation.Services.Controls.ControlBase found in its Control.Tag property.
toolBarControl: The item to update.
shortState: The Tekla.BIM.DirectManipulation.Services.Controls.ControlShortState to apply on toolBarControl as a short lived state.
factory: The toolbar control factory.

Tekla.Structures.DirectManipulation.Adapter.Controls.ToolBarControlUpdater.GetComboBoxDataItem(System.Object)
Gets the data item from the combobox's visual item.
target: The target visual item of the combobox.
Returns: The data item from the combobox's visual item.

Tekla.Structures.DirectManipulation.Adapter.Controls.ToolBarControlUpdater.UpdateTextBox(System.Windows.Controls.TextBox,Tekla.BIM.DirectManipulation.Services.Controls.IControl)
Updates the textBox to match dataSource.
textBox: The item to update.
dataSource: The data source for textBox.

Tekla.Structures.DirectManipulation.Adapter.Controls.ToolBarControlUpdater.UpdateButton(System.Windows.Controls.Primitives.ButtonBase,Tekla.BIM.DirectManipulation.Services.Controls.IControl,Tekla.Structures.DirectManipulation.Adapter.Controls.ToolBarControlFactory)
Updates the button to match dataSource.
button: The item to update.
dataSource: The data source for button.
factory: The factory.

Tekla.Structures.DirectManipulation.Adapter.Controls.ToolBarControlUpdater.UpdateContent(System.Windows.Controls.ContentControl,Tekla.BIM.DirectManipulation.Services.Controls.IControl)
Updates the content of the control based on the data source.
control: The control.
dataSource: The data source.

Tekla.Structures.DirectManipulation.Adapter.Controls.ToolBarControlUpdater.GetTextBlock(System.String)
Gets the text block control containing the text.
text: The text.
Returns: The text block control containing the text.

Tekla.Structures.DirectManipulation.Adapter.Controls.ToolBarControlUpdater.UpdatePopupContainer(System.Windows.DependencyObject,Tekla.BIM.DirectManipulation.Services.Controls.IContainerControl,Tekla.Structures.DirectManipulation.Adapter.Controls.ToolBarControlFactory)
Updates the popup container.
toggleButton: The toggle button.
containerControl: The container control.
factory: The factory.

Tekla.Structures.DirectManipulation.Adapter.Controls.ToolBarControlUpdater.UpdateComboBox(System.Windows.Controls.ComboBox,Tekla.BIM.DirectManipulation.Services.Controls.IControl,Tekla.Structures.DirectManipulation.Adapter.Controls.ToolBarControlFactory)
Updates the comboBox to match dataSource.
comboBox: The item to update.
dataSource: The data source for comboBox.
factory: The toolbar control factory.

Tekla.Structures.DirectManipulation.Adapter.Controls.ToolBarControlUpdater.UpdatePanel(System.Windows.Controls.Panel,Tekla.BIM.DirectManipulation.Services.Controls.IControl,Tekla.Structures.DirectManipulation.Adapter.Controls.ToolBarControlFactory)
Updates the panel to match dataSource.
panel: The panel to update.
dataSource: The data source for panel.
factory: The toolbar control factory.

Tekla.Structures.DirectManipulation.Adapter.Controls.ToolBarControlUpdater.UpdateExpander(System.Windows.Controls.Expander,Tekla.BIM.DirectManipulation.Services.Controls.IControl,Tekla.Structures.DirectManipulation.Adapter.Controls.ToolBarControlFactory)
Updates the expander to match dataSource.
expander: The expander to update.
dataSource: The data source for expander.
factory: The toolbar control factory.